//===================================================================
//
// Xファイル情報 [x_file_data.h]
// Author : SHUGO KURODA
//
//===================================================================
#ifndef _X_FILE_DATA_H_
#define _X_FILE_DATA_H_

#include <d3dx9.h>		// 描画処理に必要

//===================================================================
//	マクロ定義
//===================================================================
#define MAX_TEXTURE		(30)		// 1つのXファイルの最大テクスチャ数

//*******************************************************************
// Xファイル情報の構造体
//*******************************************************************
struct SModelInfo
{
	LPD3DXMESH pMesh = nullptr;			//メッシュ情報へのポインタ
	LPD3DXBUFFER pBuffMat = nullptr;	//マテリアル情報へのポインタ
	DWORD nNumMat = 0;					//マテリアル情報の数
	LPDIRECT3DTEXTURE9 pTexture[MAX_TEXTURE] = { nullptr };		//テクスチャへのポインタ
};

#endif		// _X_FILE_DATA_H_
